<html>
<head>
<title></title>
</head>
<body>
<h1>Information sur la vie priv&eacute;e</h1>
<h2>Contenu</h2>
<ul>
<li>R&eacute;sum&eacute;</li>
<li>A quoi servent les informations&nbsp;?</li>
<li>Quels sont les d&eacute;tails techniques&nbsp;?</li>
</ul>
<h2>R&eacute;sum&eacute;</h2>
<p>Quand FreeGuide d&eacute;marre, il peut v&eacute;rifier sur le
site web si une nouvelle version est disponible. Il nous est utile
de savoir combien de personnes se servent de FreeGuide, une trace
est conserv&eacute;e des interrogations faites chaque jour.</p>
<p>Vous pouvez d&eacute;cider de d&eacute;sactiver cette
v&eacute;rification compl&egrave;tement (choisissez "Non"), ou vous
pouvez activer la v&eacute;rification et choisir quelles
informations vous concernant seront conserv&eacute;es.</p>
<p>L'information la plus utile pour nous est lorsque vous
choisissez un pseudo qui vous identifie de mani&egrave;re unique.
Cela veut dire que nous pouvons conna&icirc;tre le nombre de
personnes distincte qui utilisent FreeGuide. Sinon, vous pouvez
aussi autoriser votre IP &agrave; &ecirc;tre stock&eacute;e (ce qui
arrive d&egrave;s vous visitez un site web). Ce la nous permettra
d&eacute;j&agrave; de nous faire une id&eacute;e du nombre
d'utilisateur, mais cela sera moins pr&eacute;cis car certains
fournisseurs d'acc&egrave;s internet vous donne une IP
diff&eacute;rente &agrave; chaque connexion. Enfin, vous pouvez
d&eacute;cider de faire une v&eacute;rification mais de nous ne
donner aucune info, oui vous le pouvez. Une connexion sera
malgr&eacute; tout enregistr&eacute;e mais aucune information vous
concernant ne sera enregistr&eacute;e.</p>
<p>Si cela suscite une quelconque interrogation, n'h&eacute;sitez
pas &agrave; envoyer un mail &agrave; <a href=
"mailto://freeguide-tv-devel@lists.sourceforge.net">freeguide-tv-devel@lists.sourceforge.net</a>.</p>
<h2>A quoi servent ces informations&nbsp;?</h2>
<p>A l'heure actuelle ces informations ne sont pas utilis&eacute;es
pour quoi que ce soit. Dans le futur, elles seront peut-&ecirc;tre
utilis&eacute;es dans les buts suivants&nbsp;</p>
<ul>
<li>Pour satisfaire l'ego des d&eacute;veloppeurs de
FreeGuide.</li>
<li>
<p>Pour convaincre une boite de nous donner tout plein d'argent car
nous avons plein d'utilisateurs.</p>
</li>
</ul>
<p>En aucune cas ces donn&eacute;es ne seront utilis&eacute;es pour
identifier des individus. Elles ne seront jamais vendues ou
donn&eacute;es &agrave; quiconque voudrait les utiliser &agrave;
des fins commerciales. Elles ne seront jamais utilis&eacute;es pour
vous envoyer de la pub, du SPAM, etc.</p>
<p>En gros FreeGuide est fait par passion. Un jour il y aura
peut-&ecirc;tre un peu d'argent g&eacute;n&eacute;r&eacute; par ce
projet pour moi (Andy Balaam), et cela pourrait &ecirc;tre un moyen
pour convaincre certaines personnes qu'elles devraient payer pour
&ecirc;tre le fournisseur de contenu pour un pays donn&eacute; car
ils auront plein de consultations de leur site gr&acirc;ce &agrave;
cela. Pour faire &ccedil;a, ils voudront sans doute savoir qu'il y
plein d'utilisateurs de FreeGuide, et c'est un moyen de le
prouver.</p>
<h2>Quels sont les d&eacute;tails techniques&nbsp;?</h2>
<p>Quand FreeGuide d&eacute;marre, si vous avez choisis de le
faire, FreeGuide v&eacute;rifie cette URL&nbsp;:
http://freeguide-tv.sourceforge.net/VERSION.php. Le code de cette
page est disponible dans
src/program/lib/fgspecific/VersionCheckerThread.java dans les
fichiers sources. En fonctions de vos r&eacute;glages
d'intimit&eacute;, quelques valeurs sont ajout&eacute;es &agrave;
la requ&ecirc;te GET, fournissant soit votre pseudo, ou une fausse
IP (0.0.0.0) si vous d&eacute;cidez de ne pas fournir
d'information. Si vous choisissez de fournir votre IP, l'URL est
laiss&eacute;e telle quelle et votre IP est d&eacute;tect&eacute;e
automatiquement. La version de FreeGuide que vous utilisez est
ensuite ajout&eacute;e &agrave; cette URL.</p>
<p>La date, l'identifiant (pseudo, IP ou fausse IP) et la version
sont stock&eacute;s dans un fichier situ&eacute; sur le serveur. Le
script PHP qui remplis ce fichier est disponible dans
doc/VERSION.php.</p>
</body>
</html>
